In [28]:
import pandas as pd

In [29]:
df = pd.read_csv("DW.csv")

In [30]:
df

   ID   Age Category
0   1  25.0        A
1   2   NaN        B
2   3  29.0        C
3   4   NaN        A
4   5  51.0        B
5   6  40.0        C
6   7  27.0        A
7   8   NaN        B
8   9  49.0        C
9  10  31.0        A

In [31]:
df.isnull()

      ID    Age  Category
0  False  False     False
1  False   True     False
2  False  False     False
3  False   True     False
4  False  False     False
5  False  False     False
6  False  False     False
7  False   True     False
8  False  False     False
9  False  False     False

In [32]:
df["Age"]= df["Age"].fillna(df["Age"].mean())

In [33]:
df

   ID   Age Category
0   1  25.0        A
1   2  36.0        B
2   3  29.0        C
3   4  36.0        A
4   5  51.0        B
5   6  40.0        C
6   7  27.0        A
7   8  36.0        B
8   9  49.0        C
9  10  31.0        A

In [34]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [35]:
df["RANK"]=df["Category"].map({"A":0,"B":1,"C":2})

In [36]:
df

   ID   Age Category  RANK
0   1  25.0        A     0
1   2  36.0        B     1
2   3  29.0        C     2
3   4  36.0        A     0
4   5  51.0        B     1
5   6  40.0        C     2
6   7  27.0        A     0
7   8  36.0        B     1
8   9  49.0        C     2
9  10  31.0        A     0

In [37]:
df["Age"].describe()

count    10.000000
mean     36.000000
std       8.730534
min      25.000000
25%      29.500000
50%      36.000000
75%      39.000000
max      51.000000
Name: Age, dtype: float64

In [39]:
df[df["RANK"]>1]

   ID   Age Category  RANK
2   3  29.0        C     2
5   6  40.0        C     2
8   9  49.0        C     2

In [45]:
val = 'a,b, guido' 
    
p=val.split(",")

In [46]:
p

['a', 'b', ' guido']

In [47]:
a,b,c=p

In [48]:
a

'a'

In [49]:
b

'b'

In [50]:
c

' guido'

In [54]:
"a" in p

True

SyntaxError: invalid syntax (2329800179.py, line 1)

In [65]:
"-".join(p)

'a-b- guido'

In [69]:
c=c.strip()

In [70]:
c

'guido'

In [75]:
p=",".join(p)

In [76]:
p=p.strip()

In [77]:
p

'a,b, guido'

In [79]:
data = {"name":["Arue","om","Raj"],"Age":[12,45,68]}

In [84]:
gf = pd.DataFrame(data)

In [85]:
gf

   name  Age
0  Arue   12
1    om   45
2   Raj   68